#include <stdio.h>

struct employee {
    int idNumber;  // »ç¹ø
    char name[40];  // ÀÌ¸§
    char pNumber[15];  // ÀüÈ­¹øÈ£
    int age;  // ³ªÀÌ
};

int main() {
    printf_s("20217607 ±è¹Î±â\n");
    struct employee e1[10] = {
        {1, "È«±æµ¿1", "010-1111-1111", 25},
        {2, "È«±æµ¿2", "010-1111-1111", 26},
        {3, "È«±æµ¿3", "010-1111-1111", 33},
        {4, "È«±æµ¿4", "010-1111-1111", 34},
        {5, "È«±æµ¿5", "010-1111-1111", 35},
        {6, "È«±æµ¿6", "010-1111-1111", 36},
        {7, "È«±æµ¿7", "010-1111-1111", 31},
        {8, "È«±æµ¿8", "010-1111-1111", 27},
        {9, "È«±æµ¿9", "010-1111-1111", 28},
        {10, "È«±æµ¿10", "010-1111-1111", 35}
    };

    for (int i = 0; i < 10; i++) {
        if (e1[i].age >= 20 && e1[i].age <= 30) {
            printf_s("%s\n",e1[i].name);
        }
    }

    return 0;
}
